pmorgantech/WaveX/firmware/esp32/components/ui/src/ui_main_menu.cpp
// WaveX UI Main Menu Implementation
#include "ui/ui_main_menu.h"

#include <esp_log.h>

#include "bsp/esp32_p4_nano.h"
#include "config/hardware_config.h"
#include "midi_task.h"
#include "ui/display_manager.h"
#include "ui/ui_api.h"
#include "ui/ui_cv_cal_page.h"
#include "ui/ui_diagnostics_page.h"
#include "ui/ui_instrument_page.h"
#include "ui/ui_play_page.h"
#include "ui/ui_sample_browser.h"
#include "ui/ui_sample_edit_page.h"
#include "ui/ui_sample_manager_page.h"
#include "ui/ui_sample_record_page.h"
#include "ui/ui_settings_page.h"
#include "ui/ui_system_info_page.h"
#include "ui/ui_tab_host_page.h"

#include <cstdio>
#include <string>

static const char* TAG = "UI_MAIN_MENU";

// USB MIDI input needs both flags, and the inner one is only *defined* when
// the outer is on (hardware_config.h), so the pair has to be resolved by the
// preprocessor rather than tested as a C++ expression. This is the same
// condition usb_midi_task.cpp compiles itself out on.
#if WAVEX_ESP_USB_MIDI_ENABLED && WAVEX_USB_MIDI_INPUT_ENABLED
#define WAVEX_UI_USB_MIDI_IN 1
#else
#define WAVEX_UI_USB_MIDI_IN 0
#endif

namespace wavex_ui {

namespace {

void applyBrightness(int percent) {
    esp_err_t err = DisplayManager::instance().setBrightness(static_cast<uint8_t>(percent));
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "brightness set to %d%% failed: %d", percent, (int)err);
    }
}

std::string formatPercent(int v) {
    char buf[8];
    snprintf(buf, sizeof(buf), "%d%%", v);
    return std::string(buf);
}

}  // namespace

std::shared_ptr<UIPage> createMainMenu() {
    auto menu = std::make_shared<UIMenuPage>("Main Menu");

    // Each item is a jump to its root group - the same call the panel's jump
    // keys make (panel-controls.md §4.3), so a menu selection and a key press
    // are one code path. The pages come from the factories
    // initNavigationSystem() registers, not from here.
    //
    // Instrument is a tab group too, but one page builds its own tabview
    // rather than a UITabHostPage: its five stages share the Instrument being
    // edited, so the header and status line have to outlive a tab switch. See
    // UIInstrumentPage.
    static const struct {
        const char* label;
        RootGroup group;
    } kItems[] = {
        {"Sample", RootGroup::Sample},
        {"Instrument", RootGroup::Instrument},
        {"Play", RootGroup::Play},
        {"Settings", RootGroup::Settings},
        {"Diagnostics", RootGroup::Diagnostics},
    };
    for (const auto& item: kItems) {
        const RootGroup group = item.group;
        menu->addItem(item.label, [group]() {
            ESP_LOGI(TAG, "Opening %s", rootGroupName(group));
            UINavigator::instance().jumpToRoot(group); });
    }

    return menu;
}

// Sample: four views of the CURRENT sample, so they are tabs rather than menu
// entries (docs/ui-information-architecture.md §2). Grouping them is also what
// gives the edit page a way to change which sample it edits - selecting in
// Browse or Manage is now that mechanism, closing roadmap 1.5.1 item 7.
std::shared_ptr<UIPage> createSampleGroup() {
    auto group = std::make_shared<UITabHostPage>("Sample");
    group->addTab("Manage", createSampleManagerPage());
    if (auto comm = wavex_ui::ui_get_comm_interface()) {
        group->addTab("Browse", createSampleBrowserPage(*comm));
    } else {
        // Browse needs the link; without it the tab would build an empty list
        // and look broken rather than absent.
        ESP_LOGE(TAG, "No comm interface - Browse tab omitted");
    }
    group->addTab("Edit", createSampleEditPage());
    group->addTab("Record", createSampleRecordPage());
    return group;
}

// Settings: one tab group in the same chrome as Sample and Diagnostics, with
// CV Calibration folded in as the Calibrate tab
// (docs/ui-information-architecture.md §6).
std::shared_ptr<UIPage> createSettingsGroup() {
    auto group = std::make_shared<UITabHostPage>("Settings");
    group->addTab("Display", createDisplaySettingsPage());
    group->addTab("Storage", createStorageSettingsPage());
    group->addTab("MIDI", createMidiSettingsPage());
    group->addTab("System", createSystemInfoPage());
    group->addTab("Calibrate", createCvCalPage());
    return group;
}

std::shared_ptr<UIPage> createDisplaySettingsPage() {
    auto page = std::make_shared<UISettingsPage>("Display");

    // Brightness is real: the Waveshare panel's backlight driver is an I2C
    // device and the BSP exposes bsp_display_brightness_set(). display_manager
    // drives it to 100% once at start-up so this row's initial value is the
    // truth rather than a guess - the BSP has no getter.
    //
    // The write is a 2-byte I2C transmit at 100 kHz with a 50 ms timeout, so
    // it is *bounded* - the property that matters, and not the kind of
    // open-ended block that has frozen this display before. Its actual cost on
    // the UI task is unmeasured; it happens at the rate a human turns an
    // encoder, and the sweep is on the bench list in roadmap
    // § Outstanding hardware verification.
    page->addSetting("Brightness", 100, 10, 100, applyBrightness, formatPercent);

    // Contrast is gone rather than stubbed: this is a MIPI-DSI panel driven by
    // an HX8394 with no contrast control to offer, so the row could never do
    // anything. A control that cannot exist is not a TODO.
    page->addInfo("Screen blanking", "after 5 min; touch/button/encoder wakes");
    page->addUnimplemented("Rotation", "not implemented - fixed landscape");
    page->addUnimplemented("Save on power-off", "not implemented - settings reset at boot");

    return page;
}

std::shared_ptr<UIPage> createStorageSettingsPage() {
    auto page = std::make_shared<UISettingsPage>("Storage");

    // There is genuinely nothing to configure here yet: the SD card belongs to
    // the Daisy, which mounts it itself, and every number worth seeing is
    // already on the Diagnostics ▸ Storage tab. Saying that is more useful
    // than three sliders that log and return.
    page->addInfo("Storage settings", "none yet");
    page->addInfo("SD card status", "see Diagnostics > Storage");
    page->addUnimplemented("Format SD card", "not implemented - format the card on a computer");
    page->addUnimplemented("Sample folder", "not implemented - the Daisy chooses the path");

    return page;
}

std::shared_ptr<UIPage> createMidiSettingsPage() {
    auto page = std::make_shared<UISettingsPage>("MIDI");

    // Receive channel is per Track now (Track.midi_in, MSG_TRACK_OP;
    // track-and-patch-model.md §2.2), not a global filter here - a Track set
    // to a channel could otherwise be silenced by this page with nothing on
    // screen to say why. The Track page (stage 4) is where it is edited.
    page->addInfo("Receive channel", "per Track - see the Track page");

    page->addInfo("DIN MIDI in", WAVEX_ESP_DIN_MIDI_ENABLED ? "enabled" : "disabled in build");
    page->addInfo("USB MIDI in", WAVEX_UI_USB_MIDI_IN ? "enabled" : "disabled in build");

    // Everything below is named because it is the first thing anyone looks for
    // on a MIDI settings page, and finding nothing is ambiguous in a way that
    // "not implemented" is not.
    page->addUnimplemented("Velocity curve", "not implemented - velocity passes through unchanged");
    page->addUnimplemented("Clock source", "not implemented - MIDI clock is not received yet");
    page->addUnimplemented("MIDI out", "not implemented - no output port is driven");
    page->addUnimplemented("CC mapping", "not implemented - incoming CCs are discarded");
    page->addUnimplemented("Save on power-off",
                           "not implemented - Track routing resets to one channel per Track");

    return page;
}

}  // namespace wavex_ui
